Revit 2024 API
OverridePermissions Enumeration
 Types of overrides that can be applied to a category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum OverridePermissions
Visual Basic
Public Enumeration OverridePermissions
Visual C++
public enum class OverridePermissions
Members
Member name | Description
ViewDetailLevel |  View detail level
Halftone |  Halftone
CutLines |  Cut lines
CutFills |  Cut fills
ProjectionLines |  Projection lines
ProjectionFills |  Projection fills
Surfaces |  Surface transparency
See Also
Autodesk.Revit.DB Namespace